/*******
TIMER0/2 计时器
******/
#include "timer.h"

/*计时1满10ms中断1次，中断flag0+1*/
void Timer0Init(void)		//10毫秒@6.000MHz,自动重装初值
{
	AUXR &= 0x7F;		//定时器时钟12T模式
	TMOD &= 0xF0;		//设置定时器模式
	TL0 = 0x78;		//设置定时初值
	TH0 = 0xEC;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
	ET0 =1;			//开启定时器0中断
	EA=1;   		//开启总中断
}

//void Timer2Init(void)		//10毫秒@6.000MHz
//{
//	AUXR &= 0xFB;		//定时器时钟12T模式
//	T2L = 0x78;		//设置定时初值
//	T2H = 0xEC;		//设置定时初值
//	AUXR |= 0x10;		//定时器2开始计时
//	IE2 |= 0x04;	//开启定时器2中断
//	EA=1;   		//开启总中断
//}
