#include "uart.h"

/*=====================================================================================================
名称：serial_port_initial(void)
描述：串口初始化
输入：无
输出：无
======================================================================================================*/
void UartInit(void)		//9600bps@6.000MHz
{
	SCON = 0x50;		//8位数据,可变波特率
	AUXR |= 0x01;		//串口1选择定时器2为波特率发生器
	AUXR |= 0x04;		//定时器2时钟为Fosc,即1T
	T2L = 0x64;			//设定定时初值
	T2H = 0xFF;			//设定定时初值
	AUXR |= 0x10;		//启动定时器2
	ES	=1;         	//允许串口中断
	EA	=1;	        	//开总中断
}

/*===============================================
名称：void UART_String( uchar *s )
描述：串口发送字符串
输入：uchar *s
输出：无
=================================================*/
void UART_String( uchar *s )
{
	 ES = 0;    				//关串口中断;
	while(*s)
	{

	    TI = 0;    				//清0串口发送完成中断请求标?
		SBUF = *s++;
	    while(TI == 0);  		//等待发送完成
	    TI = 0;     			//清0串口发送完成中断请求标志
	}
	ES = 1;    				//允许串口中断
}

/*===============================================
名称：void UART_Char( uchar i )
描述：串口发送字符
输入：uchar i
输出：无
=================================================*/
void UART_Char( uchar i )
{
    ES = 0;    				//关串口中断;
    TI = 0;    				//清0串口发送完成中断请求标志;
    SBUF = i;
    while(TI == 0);  		//等待发送完成
    TI = 0;     			//清0串口发送完成中断请求标志
    ES = 1;    				//允许串口中断
}